#### `terraform plan` Success for `deployments/`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # aws_iam_role.example[0] will be created
+ resource "aws_iam_role" "example" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::595072229124:role/elzwhere"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "neo"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role.example[1] will be created
+ resource "aws_iam_role" "example" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::595072229124:role/elzwhere"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "trinity"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role.example[2] will be created
+ resource "aws_iam_role" "example" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::595072229124:role/elzwhere"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "morpheus"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role.orbis-oam will be destroyed
- resource "aws_iam_role" "orbis-oam" {
      - arn                   = "arn:aws:iam::595072229124:role/orbis-oam" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::595072229124:role/elzwhere"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2020-04-23T23:05:23Z" -> null
      - force_detach_policies = false -> null
      - id                    = "orbis-oam" -> null
      - max_session_duration  = 3600 -> null
      - name                  = "orbis-oam" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - unique_id             = "AROAYVDIRT4CMQ6Q67RXS" -> null
    }

  # aws_iam_role.orbis-obm will be destroyed
- resource "aws_iam_role" "orbis-obm" {
      - arn                   = "arn:aws:iam::595072229124:role/orbis-obm" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::595072229124:role/elzwhere"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2020-04-23T23:05:23Z" -> null
      - force_detach_policies = false -> null
      - id                    = "orbis-obm" -> null
      - max_session_duration  = 3600 -> null
      - name                  = "orbis-obm" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - unique_id             = "AROAYVDIRT4CH3G5ADHHB" -> null
    }

Plan: 3 to add, 0 to change, 2 to destroy.
```

</details>

*Workflow: `Terraform Build`, Action: `self2`*